Case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   0.001;

vertices
(
    (0 0 0)
    (0 0 1)
    (0 2 0)
    (0 2 1)
    (5 0 0)
    (5 0 1)
    (5 2 0)
    (5 2 1)
    (7 0 0)
    (7 0 1)
    (7 2 0)
    (7 2 1)
    (50 0 0)
    (50 0 1)
    (50 2 0)
    (50 2 1)
    (70 0 0)
    (70 0 1)
    (70 2 0)
    (70 2 1)
    (122 0 0)
    (122 0 1)
    (122 2 0)
    (122 2 1)
    (50 12 0)
    (50 12 1)
    (70 12 0)
    (70 12 1)
);

blocks
(
    hex (0 4 6 2 1 5 7 3)  (125 50 1) simpleGrading (1 (
                        (0.1 0.2 10)
                        (0.8 0.6 1)
                        (0.1 0.2 0.1)
        ) 1)
    hex (4 8 10 6 5 9 11 7)  (50 50 1) simpleGrading (1 (
                        (0.1 0.2 10)
                        (0.8 0.6 1)
                        (0.1 0.2 0.1)
        ) 1)
    hex (8 12 14 10 9 13 15 11)  (1075 50 1) simpleGrading (1 (
                        (0.1 0.2 10)
                        (0.8 0.6 1)
                        (0.1 0.2 0.1)
        ) 1)
    hex (12 16 18 14 13 17 19 15)  (500 50 1) simpleGrading (1 (
                        (0.1 0.2 10)
                        (0.8 0.6 1)
                        (0.1 0.2 0.1)
        ) 1)
    hex (16 20 22 18 17 21 23 19)  (1300 50 1) simpleGrading (1 (
                        (0.1 0.2 10)
                        (0.8 0.6 1)
                        (0.1 0.2 0.1)
        ) 1)
    hex (14 18 26 24 15 19 27 25)  (500 250 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    paper
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
            (8 12 13 9)
            (12 16 17 13)
            (16 20 21 17)
        );
    }

    airWall
    {
        type empty;
        faces
        (
            (0 2 6 4)
            (1 5 7 3)
            (4 6 10 8)
            (5 9 11 7)
            (8 10 14 12)
            (9 13 15 11)
            (12 14 18 16)
            (13 17 19 15)
            (16 18 22 20)
            (17 21 23 19)
            (14 18 26 24)
            (15 19 27 25)
        );
    }

    inlet
    {
        type inlet;
        faces
        (
            (1 3 2 0)
        );
    }

    outlet
    {
        type outlet;
        faces
        (
            (20 22 23 21)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (2 3 7 6)
            (6 7 11 10)
            (10 11 15 14)
            (18 19 23 22)
        );
    }

    topOutletWalls
    {
        type wall;
        faces
        (
            (14 15 25 24)
            (18 19 27 26)
        );
    }

    topOutlet
    {
        type outlet;
        faces
        (
            (24 26 27 25)
        );
    }

);

mergePatchPairs
(
);
