Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    paper
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          3050;
        startFace       551650;
    }

    airWall
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          555000;
        startFace       554700;
    }

    inlet
    {
        type            inlet;
        nFaces          50;
        startFace       1109700;
        faces           ( ( 1 3 2 0 ) );
    }

    outlet
    {
        type            outlet;
        nFaces          50;
        startFace       1109750;
        faces           ( ( 20 22 23 21 ) );
    }

    topWall
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          2550;
        startFace       1109800;
    }

    topOutletWalls
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          500;
        startFace       1112350;
    }

    topOutlet
    {
        type            outlet;
        nFaces          500;
        startFace       1112850;
        faces           ( ( 24 26 27 25 ) );
    }

)


// ************************************************************************* //
